Repository: doubleden/RustQuiz
Catalog: RustQuiz/Localization/Localizable.xcstrings
Source language: en
Languages: ru

source: In reverse order of declaration
ru: В обратном порядке объявления

source: In Rust, await is postfix: future.await
ru: В Rust await - это postfix: future.await

source: In Rust, everything is private by default
ru: В Rust все по умолчанию является частным

source: In Rust, mutability is set for the whole instance. Individual fields can't be declared mut
ru: В Rust изменяемость задается for всего экземпляра. Отдельные поля не могут быть объявлены mut

source: In separate crate with special type
ru: В отдельных crate со специальными type

source: In small files
ru: В маленьких файлах

source: In target/
ru: В цель/

source: In tests
ru: В тестах

source: In the binary file
ru: В двоичном файле

source: In the FileDownloadRequest example, what does the generic parameter P represent?
ru: В примере FileDownloadRequest что представляет собой общий параметр P?

source: In the Fold pattern, what does a Folder trait typically contain?
ru: Что обычно содержится в шаблоне Folder trait?

source: In the imperative example, how is the sum calculated?
ru: Как вычисляется сумма в императивном примере?

source: In the mod tree
ru: На дереве mod

source: In the signature
ru: В подписи

source: In the Strategy pattern example, what do Text and Json represent?
ru: В примере паттерна Strategy, что представляют собой do Text и Json?

source: In what order is match guard applied with |?
ru: В каком порядке наносится match guard |?

source: In where
ru: На сайте where

source: Inclusive range of values
ru: Всеобъемлющий диапазон значений

source: Increase object lifetimes
ru: Увеличение времени жизни объектов

source: Increases binary size due to monomorphization
ru: Увеличивает размер бинарного файла из-за мономорфизации

source: Increases dependencies
ru: Увеличивает количество зависимостей

source: Increases speed
ru: Увеличивает скорость

source: Increments strong reference count
ru: Увеличивает количество сильных ссылок

source: Index 1 → second element
ru: Индекс 1 → второй элемент

source: Index 2
ru: Индекс 2

source: Indexed by .0
ru: Индексируется по .0

source: Indexing with [] returns &T, not a value
ru: Индексирование с помощью [] возвращает &amp;T, а не значение

source: Indirection provides known size
ru: Направленность обеспечивает известный размер

source: Infinite cycle causes stack overflow
ru: Бесконечный цикл приводит к переполнению стека

source: Infinite loop until break:
ru: Бесконечные loop до break:

source: Infinite range
ru: Бесконечный диапазон

source: Infix expressions to postfix notation
ru: Перевод инфиксных выражений в постфиксную нотацию

source: Inheritance
ru: Наследство

source: Inheritance is always better
ru: Наследование всегда лучше

source: init_* functions
ru: функции init_*

source: Input, Transform, and Output
ru: Вход, преобразование и выход

source: Inserts only if the key is absent
ru: Вставляет только if ключ отсутствует

source: Inside the body
ru: Внутри тела

source: int or bool
ru: инт или bool

source: Interface
ru: Интерфейс

source: Interface Segregation
ru: Разделение интерфейсов

source: Interface Segregation Principle (ISP)
ru: Принцип разделения интерфейсов (ISP)

source: interface Summary { … }
ru: интерфейс Summary { ... }

source: Interface-based inheritance
ru: Наследование на основе интерфейса

source: Interfaces should be closed to extension
ru: Интерфейсы должны быть закрыты для расширения

source: Interfaces should never be split
ru: Интерфейсы никогда не должны быть разделены

source: Interior mutability pattern in action
ru: Интерьерная мутабельность in действие

source: Interior mutability through RefCell allows mutation with &self
ru: Внутренняя мутабельность через RefCell позволяет мутировать с &ampself

source: Internal
ru: Внутренний

source: Interpreter pattern defines a language and grammar to solve problem instances
ru: Интерпретатор определяет язык и грамматику для решения проблемных ситуаций

source: Invalid states become compilation errors
ru: Недопустимые состояния become Ошибки компиляции

source: IO-bound require more memory
ru: Связанные с IO требуют больше памяти

source: Irrefutable
ru: Неопровержимый

source: Irrefutable pattern always matches any possible value
ru: Непреложный образец всегда соответствует любому возможному значению

source: Is 2× slower
ru: В 2 раза медленнее

source: Is accessing immutable static variable safe?
ru: Безопасен ли доступ к неизменяемой переменной static?

source: Is always a deep copy
ru: Это всегда глубокая копия

source: Is always by reference
ru: Всегда по ссылке

source: Is async useful for CPU-bound tasks?
ru: Полезен ли async for для задач, привязанных к процессору?

source: Is Box<T> a "thin" pointer?
ru: Является ли Box<T> "тонкий" указатель?

source: Is it true: Arc<T> itself provides mutation of T?
ru: Это true: Arc<T> сама по себе обеспечивает мутацию T?

source: Is Send/Sync automatically (derived) implemented?
ru: Осуществляется ли отправка/синхронизация автоматически (производная)?

source: Is Some(x) in let Some(x) = value refutable or irrefutable?
ru: Является ли Some(x) in let Some (x) = значение опровержимым или неопровержимым?

source: Is str (without &) a DST?
ru: Является ли str (без &amp;) DST?

source: Is there runtime overhead with generics?
ru: Есть ли накладные расходы на выполнение при использовании дженериков?

source: Is trpl::join fair?
ru: Является ли trpl::честным?

source: Is unsafe block needed inside unsafe function for unsafe operations?
ru: Нужен ли блок unsafe внутри функции unsafe for unsafe ?

source: Is x in for x in y a pattern?
ru: Является ли x in for x in y шаблоном?

source: Iso is a pair of functions (serialize/deserialize) that convert between two specific types
ru: Iso - это пара функций (serialize/deserialize), которые конвертируют между двумя определенными типами

source: ISP prevents clients from being forced to implement interfaces they don't use
ru: ISP предотвращает принуждение клиентов к реализации интерфейсов, которые им не нужны use

source: ISP prevents forcing clients to depend on interfaces they don't use
ru: Провайдер не заставляет клиентов зависеть от интерфейсов, которые им не нужны use

source: It alternates so one future can't starve the other
ru: Они чередуются, чтобы одно будущее не смогло уморить голодом другое

source: It becomes a regular function
ru: Она становится регулярной функцией

source: It causes memory leaks
ru: Это приводит к утечкам памяти

source: It compiles
ru: Он компилирует

source: It doesn't compile
ru: Не компилируется

source: It doesn't compile — return type mismatch
ru: Не компилируется - return type несоответствие

source: It doesn't return the original value
ru: Он не return первоначальную стоимость

source: It doesn't support generic programming
ru: Он не поддерживает универсальное программирование

source: It emits items from several source streams
ru: Он излучает элементы из нескольких исходных потоков

source: It increases binary size
ru: Он увеличивает размер двоичных файлов

source: It lets you specify what to replace the value with
ru: Он позволяет указать, чем заменить значение

source: It makes code faster
ru: Это делает код быстрее

source: It makes code run slower
ru: Это заставляет код работать медленнее

source: It makes systems more complex
ru: Это делает системы более сложными

source: It manages a heap resource (Drop)
ru: Он управляет ресурсом кучи (Drop)

source: It minimizes surface area for memory unsafety
ru: Он минимизирует площадь поверхности for памяти

source: It only works with Option
ru: Он работает только с Option

source: It opts out of Rust's stability by breaking builds on new warnings
ru: Он отказывается от стабильности Rust, нарушая сборки при новых предупреждениях

source: It passes messages between futures asynchronously
ru: Он передает сообщения между фьючерсами асинхронно

source: It prevents compilation
ru: Он предотвращает компиляцию

source: It prints the struct
ru: Он печатает struct

source: It reduces binary size
ru: Он уменьшает размер двоичных файлов

source: It remains accessible
ru: Он остается доступным

source: It requires 'static
ru: Для этого требуется 'static

source: It requires Clone
ru: Для этого необходимо Clone

source: It requires more dependencies
ru: Для этого требуется больше зависимостей

source: It requires runtime type checking
ru: Он требует проверки type во время выполнения

source: It returns Either::Left or Either::Right based on which future wins
ru: Он возвращает либо::влево, либо::вправо, в зависимости от того, какое будущее победит

source: It simplifies trait implementations
ru: Это упрощает реализацию trait

source: It spawns a runtime-managed task (not an OS thread)
ru: Он порождает задачу, управляемую временем выполнения (не поток ОС)

source: It speeds up
ru: Это ускоряет

source: It takes an iterator of futures and completes when all are done
ru: Он принимает итератор фьючерсов и завершается, когда все фьючерсы выполнены

source: It waits for all given futures and returns all results
ru: Он ждет for все заданные фьючерсы и возвращает все результаты

source: It wraps the stream and errors if an item is late
ru: Он оборачивает поток и выдает ошибку if, если элемент опоздал

source: It's &str
ru: Это &ampstr

source: It's &T with borrow counting
ru: Это &amp;T с заимствованным подсчетом

source: It's a smart pointer with Deref to &T
ru: Это умный указатель с Deref на &amp;T

source: It's a surprising idiom that misuses Deref's intended purpose
ru: Это удивительная идиома, которая неправильно использует предназначение Deref

source: It's a syntax error
ru: Это синтаксическая ошибка

source: It's always copied, even if it's a String
ru: Его всегда копируют, даже if String

source: It's an analog of C++ include
ru: Это аналог C++ include

source: It's an error
ru: Это ошибка

source: It's an idiom to explicitly denote "cheap" reference-cloning
ru: Это идиома для явного обозначения "дешевого" клонирования ссылок

source: It's an internal implementation detail
ru: Это внутренняя деталь реализации

source: It's an iterator adapter
ru: Это адаптер итератора

source: It's Box<T>
ru: Это Box<T>

source: It's cloned
ru: Он клонирован

source: It's common for types to implement both Default and an empty new() constructor
ru: Обычно типы for реализуют как конструктор Default, так и пустой конструктор new()

source: It's commonly used in the tests module to import everything
ru: Обычно используется in модуль tests для импорта всего

source: It's copied
ru: Он скопирован

source: It's deprecated
ru: Он устарел

source: It's designed more like functional languages than imperative ones
ru: Он создан скорее как функциональные языки, чем как императивные

source: It's faster
ru: Это быстрее

source: It's fine; w isn't tied to s
ru: Все в порядке; w не привязано к s

source: It's forbidden
ru: Это запрещено

source: It's forbidden by syntax
ru: Это запрещено синтаксисом

source: It's harder to read
ru: Читать труднее

source: It's identical to C++
ru: Он идентичен C++

source: It's moved
ru: Он переехал

source: It's moved and no longer accessible
ru: Он переехал и больше не доступен

source: It's only about pub/private
ru: Это всего лишь pub/private

source: It's only about workspaces
ru: Речь идет только о рабочих пространствах

source: It's Rc<T>
ru: Это Rc<T>

source: It's removed from the code
ru: Он удален из кода

source: It's required for all async blocks
ru: Требуется for все блоки async

source: It's slow
ru: Медленно

source: It's slower
ru: Медленнее

source: It's slower than alternatives
ru: Это медленнее, чем альтернативные варианты

source: It's the combination of packages, crates, modules, paths, and use
ru: Это комбинация пакетов, ящиков, модулей, путей и use

source: It's the only way
ru: Это единственный способ

source: It's too long
ru: Это слишком долго

source: It's Weak<T>
ru: Слабость<T>

source: iter
ru: итер

source: iter → &T, into_iter → T, iter_mut → &mut T
ru: iter → &amp;T, into_iter → T, iter_mut → &amp;mut T

source: iter → copies, into_iter → references
ru: iter → копии, into_iter → ссылки

source: iter works faster
ru: итер работает быстрее

source: Iterates IntoIterator
ru: Итераторы IntoIterator

source: Iterator and IntoIterator
ru: Итератор и IntoIterator

source: Iterator implementation
ru: Реализация итератора

source: Iterator of &str slices
ru: Итератор ломтиков &ampstr

source: Iterator of &String
ru: Итератор из &ampString

source: Iterator only works with Vec
ru: Итератор работает только с Vec

source: Iterator requires defining next()
ru: Итератор требует определения next()

source: Iterators and closures provide readability and don't compromise performance compared to manual loops
ru: Итераторы и закрытия обеспечивают удобство чтения и не снижают производительность по сравнению с ручными циклами

source: Iterators are too slow
ru: Итераторы работают слишком медленно

source: Iterators compile to code at the level of manual loops
ru: Итераторы компилируются в код на уровне ручных циклов

source: Iterators defer computation until a consuming method
ru: Итераторы откладывают вычисления до тех пор, пока не появится потребляющий метод

source: Iterators have complex lifetime relationships that are difficult to express safely in FFI
ru: Итераторы имеют сложные отношения времени жизни, которые трудно выразить безопасно in FFI

# iterators_closures_link
source: https://doc.rust-lang.org/book/ch13-00-functional-features.html
ru: https://doc.rust-lang.ru/book/ch13-00-functional-features.html

source: Jan
ru: Ян

source: join_all requires uniform output types
ru: join_all требует унифицированных типов вывода

source: join! can take any number of futures as arguments
ru: join! может принимать любое количество аргументов фьючерсов as

source: join() blocks calling thread until spawned one finishes
ru: join() блокирует вызывающий поток до тех пор, пока не завершится порожденный поток

source: join() blocks until completion
ru: join() блокируется до завершения

source: join() returns the closure's result
ru: join() возвращает результат закрытия

source: JoinHandle<(Sender<T>, Receiver<T>)>
ru: JoinHandle&lt;(Sender<T>, Receiver<T>)&gt

source: Joins strings
ru: Объединяет строки

source: Joins two iterators sequentially
ru: Последовательно объединяет два итератора

source: Joins two threads
ru: Объединяет два потока

source: JSON parsing code
ru: Код разбора JSON

source: JSON to XML
ru: JSON в XML

source: Just println!("{:?}")
ru: Просто println!("{:?}")

source: kebab-case
ru: шашлычница

source: Keep Implementing Smart Solutions
ru: Продолжайте внедрять умные решения

source: Keep It Simple, Stupid
ru: Будь проще, дурачок

source: Keep Iterating Simple Structures
ru: Продолжайте итерировать простые структуры

source: Keep them borrowed rather than copying
ru: Заимствуйте их, а не копируйте

source: Keeping foreign strings borrowed allows zero-cost operations when passing between Rust and C
ru: Сохранение заимствованных строк позволяет выполнять операции с нулевыми затратами при переходе между Rust и C

source: Keeps elements whose closure returns true
ru: Сохраняет элементы, закрытие которых возвращает true

source: Keyword fn
ru: Ключевое слово fn

source: KISS states that simplicity should be a key goal and unnecessary complexity should be avoided
ru: KISS утверждает, что простота должна быть ключевой целью, а излишней сложности следует избегать

source: Knowledge Is Super Smart
ru: Знание - это суперумно

source: Lack of support for certain generic type boundaries
ru: Отсутствие поддержки for определенных общих type границ

source: Language
ru: Язык

source: Language syntax doesn't matter
ru: Синтаксис языка не имеет значения

source: Larger binaries
ru: Крупные двойные тела

source: Last element
ru: Последний элемент

source: Last expression with ;
ru: Последнее выражение с ;

source: Last expression without ;
ru: Последнее выражение без ;

source: Last updated: October 22, 2025
ru: Обновлено: 22 Октября 2025

source: Lazily creates a value on error
ru: Лениво создает значение при ошибке

source: Lead to data race
ru: Приводят к гонке данных

source: Lead to double free
ru: Вести к двойной свободе

source: Lead to memory leak
ru: Приводит к утечке памяти

source: Lead to UB
ru: Вести в ПБ

source: Leads to double destruction/panic
ru: Приводит к двойному разрушению/панике

source: Leak occurs
ru: Возникает утечка

source: Learned %lld%%
ru: Изучено %lld%%

source: len() returns bytes; Cyrillic letters here are 2 bytes each
ru: len() возвращает байты; кириллические буквы здесь занимают по 2 байта

source: Length
ru: Длина

source: Length is part of type
ru: Длина является частью type

source: Less memory usage
ru: Меньшее использование памяти

source: let creates an immutable binding mutability is only via mut
ru: let создает неизменяемую привязку, которую можно изменить только через mut

source: let is evaluated only at compile-time
ru: let оценивается только во время компиляции

source: let mut x = ... is the only syntax to allow mutation
ru: let mut x = ... - единственный синтаксис, допускающий мутацию

source: let name: Type = expr;
ru: let имя: тип = expr;

source: Let the caller choose a recovery strategy
ru: Дайте абоненту выбрать стратегию восстановления

source: let x = ...; let x = ...; creates a new binding
ru: let x = ...; let x = ...; создает новую привязку

source: let y = 6 is not an expression
ru: let y = 6 не является выражением

source: Let, for, and function parameters require irrefutable patterns
ru: Let, for, и параметры функций требуют неопровержимых закономерностей

source: let…else is always faster
ru: let...else всегда быстрее

source: let…else requires the else branch to exit (e.g., return)
ru: let...else требует выхода из ветки else (например, return)

source: let…else works only with Option
ru: let...else работает только с Option

source: Lets you list the possible variants of a type
ru: Позволяет перечислить возможные варианты type

source: Lets you omit the field name if it matches the parameter name
ru: Позволяет опустить имя поля if, которое совпадает с именем параметра

source: Lets you set a custom panic message
ru: Позволяет задать пользовательское сообщение о панике

source: Library for unsafe
ru: Библиотека for unsafe

source: Library only
ru: Только в библиотеке

source: Lifetime and ownership complications
ru: Срок службы и сложности владения

source: Lifetime management and aliasing rules are hard to maintain
ru: Управление временем жизни и правила псевдонимов трудно поддерживать

source: Lifetimes always start with '
ru: Жизни всегда начинаются с '

source: Lifetimes are extended as long as possible within the function scope
ru: Время жизни продлевается as на длительный срок as, возможный в пределах области применения функции

source: Lifetimes are part of the function contract
ru: Время жизни является частью контракта на выполнение функций

source: Lifetimes connect references and are checked at compile-time
ru: Времена жизни связывают ссылки и проверяются во время компиляции

source: Lifetimes describe how long a reference lives
ru: Время жизни описывает, как долго живет ссылка

source: LIFO — last created, first destroyed
ru: LIFO - последний созданный, первый уничтоженный

source: Lifting
ru: Подъемник

source: Light vs. heavy
ru: Легкий против тяжелого

source: Lightweight green thread of runtime
ru: Легкий зеленый поток времени выполнения

source: Like closures, move captures by value for later use
ru: Как и в случае с закрытиями, move захватывает по значению for позже use

source: Limits the number of items produced
ru: Ограничивает количество производимых предметов

source: Limits the rate of receiving items
ru: Ограничивает скорость получения предметов

source: link
ru: ссылка

source: Link-time optimization across crate boundaries is not enabled by default
ru: Оптимизация времени соединения через границы crate по умолчанию не включена

source: list and average
ru: список и среднее значение

source: List size cannot be computed — need indirection via pointer (Box, Rc, &)
ru: Размер списка не может быть вычислен - необходимо перенаправление через указатель (Box, Rc, &amp;)

source: Literal suffix sets type
ru: Буквальные наборы суффиксов type

source: Local Storage
ru: Локальное хранилище

source: Lock is always released via Drop of MutexGuard
ru: Блокировка всегда освобождается через сброс MutexGuard

source: Lock remains forever
ru: Замок остается навсегда

source: LoD is also known as the principle of least knowledge or information hiding
ru: LoD также известен as как принцип наименьшего знания или сокрытия информации

source: LoD reduces coupling by limiting knowledge about other objects' structures
ru: LoD уменьшает связь, ограничивая знания о структурах других объектов

source: Logging and continuing
ru: Ведение журнала и продолжение работы

source: Logical AND
ru: Логическое И

source: Logical OR — matches any of the patterns
ru: Логическое ИЛИ - соответствует любому из шаблонов

source: loop has no condition
ru: loop не имеет условий

source: loop is an expression
ru: loop это выражение

source: Loop labels 'label:
ru: Цикл меток 'label:

source: Low-level programming
ru: Низкоуровневое программирование

source: Lowercase, not a string
ru: Нижний регистр, не строка

source: LSP ensures that subtypes can stand in for their parent types without breaking the program
ru: LSP гарантирует, что подтипы могут стоять in for своих родительских типов без нарушения программы

source: Macro creating new attributes for any elements
ru: Макрос, создающий новые атрибуты for любых элементов

source: Macro for attributes
ru: Атрибуты макроса for

source: Macro for deriving
ru: Макро for выведение

source: Macro for structs
ru: Макрос for Структуры

source: Macro for traits
ru: Макро for черты

source: Macro generating code with #[derive] attribute
ru: Макрос, генерирующий код с атрибутом #[derive]

source: Macro to create a vector with elements:
ru: Макрос для создания вектора с элементами:

source: Macro with declaration
ru: Макрос с объявлением

source: Macro with macro_rules!, working via pattern matching
ru: Макрос с macro_rules!, работающий через сопоставление шаблонов

source: macro_rules! allows defining custom syntax and expansion rules, similar to interpreter pattern concepts
ru: macro_rules! позволяет определять пользовательские правила синтаксиса и расширения, аналогичные концепциям шаблонов интерпретатора

source: Macros
ru: Макросы

source: Macros are faster
ru: Макросы работают быстрее

source: Macros expand before compilation and are more flexible than functions
ru: Макросы расширяются до компиляции и являются более гибкими, чем функции

source: Macros expand before compilation and can take variable arguments
ru: Макросы раскрываются перед компиляцией и могут принимать переменные аргументы

source: main can return Result, then ? is allowed
ru: main можно return Resultтогда ? разрешается

source: main must return Result for ? on Result to be valid
ru: main обязательно return Result for ? on Result быть действительным

source: main sets up the runtime that runs async code
ru: main настраивает среду выполнения, которая запускает код async

source: main should initialize the runtime rather than be part of it
ru: main должны инициализировать среду выполнения, а не быть ее частью

source: Main thread waits, then executes its work (no interleaving)
ru: Главный поток ждет, затем выполняет свою работу (без чередования)

source: make
ru: сделать

source: Make all methods have side effects
ru: Сделайте так, чтобы все методы имели побочные эффекты

source: Make crates as large as possible
ru: Сделать ящики as большими as возможно

source: Make it the last expression without ;
ru: Сделайте это последним выражением без ;
